In [1]:
import pandas as pd
import numpy as np

In [45]:
names = ['id', 'limit_bal','sex','education','marriage','age','pay_september','pay_august','pay_july','pay_june','pay_may','pay_april','bill_september','bill_august','bill_july','bill_june','bill_may','bill_april','pay_amt_september','pay_amt_august','pay_amt_july','pay_amt_june','pay_amt_may','pay_amt_april','default']
df1 = pd.read_csv('/Users/sai/workspace/hackathon/GreyAtom-Hackathon/default of credit card clients.csv', names=names)
df = df1[2:]
df.head()

,id,limit_bal,sex,education,marriage,age,pay_september,pay_august,pay_july,pay_june,...,bill_june,bill_may,bill_april,pay_amt_september,pay_amt_august,pay_amt_july,pay_amt_june,pay_amt_may,pay_amt_april,default
2,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
3,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
4,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
5,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
6,5,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

/Users/sai/workspace/hackathon/GreyAtom-Hackathon

In [61]:
sex = pd.get_dummies(df.sex)
sex.columns = ['Male', 'Female']

   Male  Female
2     0       1

In [59]:
df['education'].replace(6,4, inplace = True)

In [60]:
edu = pd.get_dummies(df.education)
edu.head(1)

   0  1  2  3  4  5  6
2  0  0  1  0  0  0  0

In [32]:
df['marriage'].replace(0,3, inplace = True)

In [35]:
mar = pd.get_dummies(df.marriage)
mar.columns = ['married' ,'single', 'mar_others']

   married  single  mar_others
0        0       1           0